package org.cleverframe.quartz;

import org.cleverframe.common.IBeanNames;

/**
 * 定义当前quartz模块定义的Spring Bean名称<br/>
 * <p/>
 * 作者：LiZW <br/>
 * 创建时间：2016-7-26 17:02 <br/>
 */
public class QuartzBeanNames implements IBeanNames {
    // -------------------------------------------------------------------------------------------//
    // Dao
    // -------------------------------------------------------------------------------------------//

    // -------------------------------------------------------------------------------------------//
    // Service
    // -------------------------------------------------------------------------------------------//
    public static final String  TriggerService = "quartz_TriggerService";
    public static final String  JobDetailService = "quartz_JobDetailService";


    // -------------------------------------------------------------------------------------------//
    // Other
    // -------------------------------------------------------------------------------------------//


}
